great-man2096/STM32F103ZET6-TEST/User/main.c
	// 基本计数器实验
	//	btim_timx_int_init(5000 - 1, 7200 - 1); /* 10Khz 的计数频率，计数 5K 次为 500ms */
	//	 while (1)
	//	 {
	//		 LED0_TOGGLE();
	//		 delay_ms(200);
	//	 }

	//	//窗口看门狗实验
	//	LED0(1);
	//	delay_ms(3000);
	//	wwdg_init(0x7F, 0x5F, WWDG_PRESCALER_8);
	//	while(1){
	//		LED0(0);
	//		if(HAL_GPIO_ReadPin(GPIOC,GPIO_PIN_13) == 1){
	////		delay_ms(10); //允许误差10ms,消除抖动
	//			wwdg_feed();
	//		}
	//	}

	//	独立看门狗实验
	//	delay_ms(200); /* 延时 200ms 再初始化看门狗,LED0 的变化"可见" */
	//
	//	iwdg_init(IWDG_PRESCALER_64,625); /* 预分频数 64,重载值为 625,溢出时间约为 1s */
	//	LED0(1); /* 点亮 LED0(红灯) */
	//	 //printf("led0");
	//	 while (1)
	//	 {
	//		 if (key1_scan() == 1) /* 如果 K1 按下,则喂狗 */
	//		 {
	//			iwdg_feed(); /* 喂狗 */
	//		 }else{
	//			delay_ms(10);
	//		 }

	//	 }

	//	uint8_t len;
	//	uint16_t times = 0;
	//	printf("请输入数据,以回车键结束\r\n");
	//	while (1)
	//	 {
	//	 if (g_usart_rx_sta & 0x8000) /* 接收到了数据? */
	//	 {
	//		 len = g_usart_rx_sta & 0x3fff; /* 得到此次接收到的数据长度 */
	//		 printf("\r\n 您发送的消息为:\r\n");
	//		/*发送接收到的数据	Sends an amount of data in blocking mode.*/
	//		 HAL_UART_Transmit(&g_uart1_handle,(uint8_t*)g_usart_rx_buf,len,1000);
	//		/*等待发送结束*/
	//		while(__HAL_UART_GET_FLAG(&g_uart1_handle,UART_FLAG_TC)!=SET){};
	//		 printf("\r\n\r\n"); /* 插入换行 */
	//		 g_usart_rx_sta = 0;
	//	 }
	//	 else
	//	 {
	//		 times++;
	//		 if (times % 5000 == 0)
	//		 {
	//			 printf("\r\n STM32 开发板 串口实验：\r\n");
	//			 printf("50秒打印一次\r\n\r\n\r\n");
	//		 }
	//		 if (times % 500 == 0) printf("请输入数据,以回车键结束\r\n");  //两秒打印一次
	//		 if (times % 30 == 0) LED0_TOGGLE(); /* 0.3秒闪烁一次 LED,提示系统正在运行. */
	//		 delay_ms(10);
	//	 }
	//	 }

	//	key_init();							//KEY初始化
	//	exti_init();						//EXTI初始化
	//	//外部中断实验
	//	/*
	//	通过外部中断的方式让开发板上的两个独立按键控制 LED 灯：KEY0 控制 LED0 翻转，KEY1 控制 LED1 翻转。
	//	*/
	//	LED0(1); //点亮led0
	//	while (1)
	//	{
	//		printf("OK\r\n");
	//		delay_ms(1000);
	//	 }

	// 跑马灯实验
	//	   while(1)
	//     {
	//         LED0(0);
	//		LED1(1);
	//		delay_ms(500);
	//		LED0(1);
	//		LED1(0);
	//		delay_ms(500);
	//     }
	// 按键实验
	//	while(1){
	//		if(key1_long_scan()){
	//			LED0_TOGGLE();
	//		}
	//		else if(key2_scan())
	//			{
	//				LED1_TOGGLE();
	//			}
	//		else
	//		{
	//			delay_ms(10);//允许误差10ms,消除抖动
	//		}
	//	}
}
